# ValueParsingOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ValueParsingOptions Class
Members See Also
---
Options for parsing strings into numbers with units.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ValueParsingOptions : IDisposable
```

Visual Basic
---
```text
Public Class ValueParsingOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ValueParsingOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ValueParsingOptions
# See Also
ValueParsingOptions Members
Autodesk.Revit.DB Namespace